import telebot

API_TOKEN = '7412787643:AAFwD1PXJLRwCcDnje5GeVUobojBRXgV7GA'
bot = telebot.TeleBot(API_TOKEN)

@bot.message_handler(commands=['start' , 'command0'])
def send_welcome(message):
    bot.reply_to(message, "⭐🛍️ برای خرید پی دی اف «حفظیات فیزیک دهم و یازدهم» ابتدا هزینه ناقابل PDF رو، به مبلغ 60 هزار تومن به شماره کارت\n6063731100802066\nبه نام «هادی اسدی» واریز کنید.\nسپس فیش واریزی را به آیدی\nادمین(@ASD_admin) ارسال کنید تا پس از بررسی واریزی شما ، «رمز فایل» در اسرع وقت براتون ارسال شه😎✅\nلطفاً لطفاً از اسپم کردن و ارسال پیام های اضافه خودداری کنید. ادمین ها در حال رسیدگی به سفارش شما هستند.😇\n\n•  برای دریافت فایل اصلی حفظیات ، دستور\n «📕دریافت پی‌دی‌اف اصلی حفظیات ✨🟢»\n را انتخاب کنید.\n\n•  برای دریافت فایل اصلی حفظیات ، دستور\n «✅دریافت pdf حفظیات سال دهم💯»\n را انتخاب کنید.")

@bot.message_handler(commands=['command1'])
def send_files1(message):
    chat_id = message.chat.id

    with open('حفظیات فیزیک یازدهم معادل 8 نمره.zip', 'rb') as file1:
        bot.send_document(chat_id, file1)

    bot.reply_to(message, "برای اطلاع از نحوه دریافت «رمز فایل» اصلی ابتدا دستور «شرایط و نحوه دریافت فایل📥❓»رو انتخاب کنید.❤️")

    with open('نمونه فایل حفظیات یازدهم.pdf', 'rb') as file2:
        bot.send_document(chat_id, file2)

@bot.message_handler(commands=['command2'])
def send_files3(message):
    chat_id = message.chat.id

    with open('حفظیات فیزیک دهم معادل 8 نمره.zip', 'rb') as file3:
        bot.send_document(chat_id, file3)

    bot.reply_to(message, "برای اطلاع از نحوه دریافت «رمز فایل» اصلی ابتدا دستور «شرایط و نحوه دریافت فایل📥❓»رو انتخاب کنید.❤️")

    with open('نمونه فایل حفظیات دهم.pdf', 'rb') as file4:
        bot.send_document(chat_id, file4)

@bot.message_handler(commands=['command10'])
def send_terms(message):
    bot.reply_to(message, "🔴قوانین مقرارت بات @Botfizic_bot :\n\n• ! توجه کنید وارد شدن به این بات به منزله قبول تمامی قوانین و متن های این صفحه میباشد و شما حق هیچگونه شکایت یا اعتراضی ندارید.\n\n• توجه داشته باشید این بات فقط تا تاریخ نه شهریور سال هزار و چهارصد و سه هجری شمسی «۱۴۰۳/۶/۹» فعال است و هر گونه اقدام به سفارش از طرف مشتری ( از جمله خرید محصولات، واریز وجه و ثبت سفارش ) 🔸پس از تاریخ ذکر شده🔸 به عهده خود مشتری بوده و به دلیل فعال نبودن بات و مطلع نشدن ادمین و عوامل از ثبت سفارش مشتری ، بات @Botfizic_bot هیچگونه مسئولیتی در قبال سفارشات صورت گرفته ندارد و برگشت وجه به مشتری وجود نخواهد داشت!\n\n• هرگونه فحاشی، توهین و تهدید به هریک از عوامل این بات ادمین ها و…. باعث مسدود شدن هزینه شما و بلوکه شدن آن میشود و برگشت داده نمیشود.\n\n• ورود کاربران به بات تلگرام @Botfizic_bot و استفاده از بات به معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه استفاده از سرویس‏ها و خدمات بات @Botfizic_bot است. توجه داشته باشید که خرید محصولات نیز در هر زمان به معنی پذیرفتن کامل کلیه شرایط و قوانین @Botfizic_bot از سوی کاربر است.\n\n• در صورتی که مشتری یا کاربر مبلغی به طور اشتباه به شماره کارتی غیر از شماره کارت ارائه شده «6063731100802066» واریز کرده باشد و یا هرگونه خطا یا اشتباه در مراحل ثبت سفارش و انتقال وجه انجام داده باشد، تمام مسئولیت به عهده خریدار است و @Botfizic_bot هیچ گونه مسئولیتی در قبال این مسائل ندارد.\n\n•  امکان لغو سفارش و یا برگشت هزینه بعد از دریافت رمز فایل برای محصولات خریداری شده از بات @Botfizic_bot وجود ندارد .\n\n• اگر کاربر سفارش را فقط و فقط قبل از ارسال رمز فایل از طرف ادمین  ،  به هر دلیلی لغو کند ، برگشت وجه به حساب مشتری در مدت حداکثر ۳ ساعت کاری انجام داده خواهد شد.\n\n• منظور از بات @Botfizic_bot کیست؟ :\nمنظور از @Botfizic_bot تمام عوامل این بات از جمله ادمین ها، سازنده و ... میباشد.\n\n• تعریف مشتری یا کاربر:\nمشتری یا کاربر به شخصی گفته میشود که از طریق این بات، به ثبت سفارش یا هرگونه استفاده از خدمات بات @Botfizic_bot اقدام کند. همچنین از آنجا که بات @Botfizic_bot یک بات خرده فروشی آنلاین است، طبق قانون تجارت الکترونیک ،مشتری یا مصرف کننده هر شخصی است که به منظوری جز تجارت یا شغل حرفه ای به خرید کالا یا خدمات اقدام میکند.\n\n• تعریف روز کاری :\nروز کاری به معنی روز شنبه تا پنج شنبه هر هفته، به استثنای تعطیلات عمومی در ایران است و کلیه سفارش های ثبت شده در طول روزهای کاری و اولین روز پس از تعطیلات پردازش می‏شوند. @Botfizic_bot به مشتریان خود در ۷ روز هفته و ۲۴ ساعت در روز امکان سفارش‏گذاری می‏دهد.\n\n• تعریف سفارش :\nمنظور از سفارش، شرکت در یک معامله تجاری با عوامل بات @Botfizic_bot است. سفارش به معنای قصد خرید است، و به اقدام برای خرید محصولات یا خدمات بات @Botfizic_bot سفارش میگویند.")

@bot.message_handler(func=lambda message: True)
def echo_all(message):
    bot.reply_to(message, message.text)

bot.polling()